ac.at.tuwien.s2015.wmpm.g13/test/ac/at/tuwien/s2015/wmpm/examples/testfiles/example_businessorder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:soap="http://soap.services.g13.wmpm.s2015.tuwien.at.ac/">
	<soapenv:Header />
	<soapenv:Body>
		<soap:order>
			<!--Optional: -->
			<arg0>
				<!--Optional: -->
				<customer>
					<!--Optional: -->
					<address>Mustergasse 22</address>
					<!--Optional: -->
					<email>powermaterials2015@gmail.com</email>
					<!--Optional: -->
					<personId>123654</personId>
					<!--Optional: -->
					<countryCourt>Vienna</countryCourt>
					<!--Optional: -->
					<name>Musterfirma GMBH</name>
					<!--Optional: -->
					<registrationNumber>AT123456</registrationNumber>
				</customer>
				<!--Optional: -->
				<orderDate>2014-12-12</orderDate>
				<!--Optional: -->
				<orderId>123456</orderId>
				<!--Zero or more repetitions: -->
				<orderItems>
					<!--Optional: -->
					<product>
						<!--Optional: -->
						<name>Hammer</name>
						<!--Optional: -->
						<price>10</price>
						<!--Optional: -->
						<productId>123456</productId>
					</product>
					<quantity>12</quantity>
				</orderItems>
				<!--Optional: -->
				<sendDate>2014-12-12</sendDate>
				<!--Optional: -->
				<supplier>
					<!--Optional: -->
					<address>Mustergasse 22</address>
					<!--Optional: -->
					<email>powermaterials2015@gmail.com</email>
					<!--Optional: -->
					<personId>1234</personId>
					<!--Optional: -->
					<countryCourt>Vienna</countryCourt>
					<!--Optional: -->
					<name>PowerMaterials GMBH</name>
					<!--Optional: -->
					<registrationNumber>AT32165</registrationNumber>
				</supplier>
			</arg0>
		</soap:order>
	</soapenv:Body>
</soapenv:Envelope>